# 6 умножить на 39;
# 3 в степени 5;
# Минус 8 разделить на минус 4;
# 10 разделить на 2 и прибавить 6.

print(6 * 39)
print(3 ** 5)
print(-8 / 4)
print(10 / 2 + 6)

print('*******************************')
#Создайте три переменных, каждой из них присвойте любые числа, например 5, 4, 2 (кстати, не забывайте про множественное присваивание).
#Затем выведите результат сложения, вычитания, умножения, деления и возведения в степень всех трёх переменных в отдельных строчках. Результат с 5, 4 и 2 должен выглядеть так:

first_num, second_num, third_num = 5, 4, 2

print(first_num + second_num + third_num)
print(first_num - second_num - third_num)
print(first_num * second_num * third_num)
print(first_num / second_num / third_num)
print(first_num ** second_num ** third_num)



 
